Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_ltdc.h
// TWCR Configuration

#define LTDC_TWCR_TOTALW            (0xFFFu<<16)
#define LTDC_TWCR_TOTALW_0          (0x1u<<16)
#define LTDC_TWCR_TOTALH            (0xFFFu<<0)
#define LTDC_TWCR_TOTALH_0          (0x1u<<0)

// GCR Configuration

#define LTDC_GCR_HSPOL              (0x1u<<31)
#define LTDC_GCR_VSPOL              (0x1u<<30)
#define LTDC_GCR_DEPOL              (0x1u<<29)
#define LTDC_GCR_PCPOL              (0x1u<<28)
#define LTDC_GCR_SFSWTR             (0x1u<<25)
#define LTDC_GCR_SFEN               (0x1u<<24)
#define LTDC_GCR_CRCEN              (0x1u<<19)
#define LTDC_GCR_DEN                (0x1u<<16)
#define LTDC_GCR_DRW                (0x7u<<12)
#define LTDC_GCR_DRW_0              (0x1u<<12)
#define LTDC_GCR_DGW                (0x7u<<8)
#define LTDC_GCR_DGW_0              (0x1u<<8)
#define LTDC_GCR_DBW                (0x7u<<4)
#define LTDC_GCR_DBW_0              (0x1u<<4)
#define LTDC_GCR_GAMEN              (0x1u<<1)
#define LTDC_GCR_LTDCEN             (0x1u<<0)

#define LTDC_GCR_HSPOL_B_0X0        (0x0u<<31)
#define LTDC_GCR_HSPOL_B_0X1        (0x1u<<31)
#define LTDC_GCR_VSPOL_B_0X0        (0x0u<<30)
#define LTDC_GCR_VSPOL_B_0X1        (0x1u<<30)
#define LTDC_GCR_DEPOL_B_0X0        (0x0u<<29)
#define LTDC_GCR_DEPOL_B_0X1        (0x1u<<29)
#define LTDC_GCR_PCPOL_B_0X0        (0x0u<<28)
#define LTDC_GCR_PCPOL_B_0X1        (0x1u<<28)
#define LTDC_GCR_SFSWTR_B_0X0       (0x0u<<25)
#define LTDC_GCR_SFSWTR_B_0X1       (0x1u<<25)
#define LTDC_GCR_SFEN_B_0X0         (0x0u<<24)
#define LTDC_GCR_SFEN_B_0X1         (0x1u<<24)
#define LTDC_GCR_CRCEN_B_0X0        (0x0u<<19)
#define LTDC_GCR_CRCEN_B_0X1        (0x1u<<19)
#define LTDC_GCR_DEN_B_0X0          (0x0u<<16)
#define LTDC_GCR_DEN_B_0X1          (0x1u<<16)
#define LTDC_GCR_GAMEN_B_0X0        (0x0u<<1)
#define LTDC_GCR_GAMEN_B_0X1        (0x1u<<1)
#define LTDC_GCR_LTDCEN_B_0X0       (0x0u<<0)
#define LTDC_GCR_LTDCEN_B_0X1       (0x1u<<0)

// SRCR Configuration

#define LTDC_SRCR_VBR               (0x1u<<1)
#define LTDC_SRCR_IMR               (0x1u<<0)

#define LTDC_SRCR_VBR_B_0X0         (0x0u<<1)
#define LTDC_SRCR_VBR_B_0X1         (0x1u<<1)
#define LTDC_SRCR_IMR_B_0X0         (0x0u<<0)
#define LTDC_SRCR_IMR_B_0X1         (0x1u<<0)

// GCCR Configuration

#define LTDC_GCCR_REN               (0x1u<<18)
#define LTDC_GCCR_GEN               (0x1u<<17)
#define LTDC_GCCR_BEN               (0x1u<<16)
#define LTDC_GCCR_COMP              (0xFFu<<8)
#define LTDC_GCCR_COMP_0            (0x1u<<8)
#define LTDC_GCCR_ADDR              (0xFFu<<0)
#define LTDC_GCCR_ADDR_0            (0x1u<<0)

#define LTDC_GCCR_REN_B_0X0         (0x0u<<18)
#define LTDC_GCCR_REN_B_0X1         (0x1u<<18)
#define LTDC_GCCR_GEN_B_0X0         (0x0u<<17)
#define LTDC_GCCR_GEN_B_0X1         (0x1u<<17)
#define LTDC_GCCR_BEN_B_0X0         (0x0u<<16)
#define LTDC_GCCR_BEN_B_0X1         (0x1u<<16)

// BCCR Configuration

#define LTDC_BCCR_BCRED             (0xFFu<<16)
#define LTDC_BCCR_BCRED_0           (0x1u<<16)
#define LTDC_BCCR_BCGREEN           (0xFFu<<8)
#define LTDC_BCCR_BCGREEN_0         (0x1u<<8)
#define LTDC_BCCR_BCBLUE            (0xFFu<<0)
#define LTDC_BCCR_BCBLUE_0          (0x1u<<0)

// IER Configuration

#define LTDC_IER_CRCIE              (0x1u<<7)
#define LTDC_IER_FUIE               (0x1u<<6)
#define LTDC_IER_RRIE               (0x1u<<3)
#define LTDC_IER_TERRIE             (0x1u<<2)
#define LTDC_IER_FUWIE              (0x1u<<1)
#define LTDC_IER_LIE                (0x1u<<0)

#define LTDC_IER_CRCIE_B_0X0        (0x0u<<7)
#define LTDC_IER_CRCIE_B_0X1        (0x1u<<7)
#define LTDC_IER_FUIE_B_0X0         (0x0u<<6)
#define LTDC_IER_FUIE_B_0X1         (0x1u<<6)
#define LTDC_IER_RRIE_B_0X0         (0x0u<<3)
#define LTDC_IER_RRIE_B_0X1         (0x1u<<3)
#define LTDC_IER_TERRIE_B_0X0       (0x0u<<2)
#define LTDC_IER_TERRIE_B_0X1       (0x1u<<2)
#define LTDC_IER_FUWIE_B_0X0        (0x0u<<1)
#define LTDC_IER_FUWIE_B_0X1        (0x1u<<1)
#define LTDC_IER_LIE_B_0X0          (0x0u<<0)
#define LTDC_IER_LIE_B_0X1          (0x1u<<0)

// ISR Configuration

#define LTDC_ISR_CRCIF              (0x1u<<7)
#define LTDC_ISR_FUIF               (0x1u<<6)
#define LTDC_ISR_RRIF               (0x1u<<3)
#define LTDC_ISR_TERRIF             (0x1u<<2)
#define LTDC_ISR_FUWIF              (0x1u<<1)
#define LTDC_ISR_LIF                (0x1u<<0)

#define LTDC_ISR_CRCIF_B_0X0        (0x0u<<7)
#define LTDC_ISR_CRCIF_B_0X1        (0x1u<<7)
#define LTDC_ISR_FUIF_B_0X0         (0x0u<<6)
#define LTDC_ISR_FUIF_B_0X1         (0x1u<<6)
#define LTDC_ISR_RRIF_B_0X0         (0x0u<<3)
#define LTDC_ISR_RRIF_B_0X1         (0x1u<<3)
#define LTDC_ISR_TERRIF_B_0X0       (0x0u<<2)
#define LTDC_ISR_TERRIF_B_0X1       (0x1u<<2)
#define LTDC_ISR_FUWIF_B_0X0        (0x0u<<1)
#define LTDC_ISR_FUWIF_B_0X1        (0x1u<<1)
#define LTDC_ISR_LIF_B_0X0          (0x0u<<0)
#define LTDC_ISR_LIF_B_0X1          (0x1u<<0)

// ICR Configuration

#define LTDC_ICR_CCRCIF             (0x1u<<7)
#define LTDC_ICR_CFUIF              (0x1u<<6)
#define LTDC_ICR_CRRIF              (0x1u<<3)
#define LTDC_ICR_CTERRIF            (0x1u<<2)
#define LTDC_ICR_CFUWIF             (0x1u<<1)
#define LTDC_ICR_CLIF               (0x1u<<0)

#define LTDC_ICR_CCRCIF_B_0X0       (0x0u<<7)
#define LTDC_ICR_CCRCIF_B_0X1       (0x1u<<7)
#define LTDC_ICR_CFUIF_B_0X0        (0x0u<<6)
#define LTDC_ICR_CFUIF_B_0X1        (0x1u<<6)
#define LTDC_ICR_CRRIF_B_0X0        (0x0u<<3)
#define LTDC_ICR_CRRIF_B_0X1        (0x1u<<3)
#define LTDC_ICR_CTERRIF_B_0X0      (0x0u<<2)
#define LTDC_ICR_CTERRIF_B_0X1      (0x1u<<2)
#define LTDC_ICR_CFUWIF_B_0X0       (0x0u<<1)
#define LTDC_ICR_CFUWIF_B_0X1       (0x1u<<1)
#define LTDC_ICR_CLIF_B_0X0         (0x0u<<0)
#define LTDC_ICR_CLIF_B_0X1         (0x1u<<0)

// LIPCR Configuration

#define LTDC_LIPCR_LIPOS            (0xFFFu<<0)
#define LTDC_LIPCR_LIPOS_0          (0x1u<<0)

// CPSR Configuration

#define LTDC_CPSR_CXPOS             (0xFFFu<<16)
#define LTDC_CPSR_CXPOS_0           (0x1u<<16)
#define LTDC_CPSR_CYPOS             (0xFFFu<<0)
#define LTDC_CPSR_CYPOS_0           (0x1u<<0)

// CDSR Configuration

