Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_ltdc.h
#define LTDC_L2C1R_SCA_B_0X0        (0x0u<<31)
#define LTDC_L2C1R_SCA_B_0X1        (0x1u<<31)
#define LTDC_L2C1R_YFPA_B_0X0       (0x0u<<2)
#define LTDC_L2C1R_YFPA_B_0X1       (0x1u<<2)
#define LTDC_L2C1R_YSPA_B_0X0       (0x0u<<1)
#define LTDC_L2C1R_YSPA_B_0X1       (0x1u<<1)
#define LTDC_L2C1R_YIA_B_0X0        (0x0u<<0)
#define LTDC_L2C1R_YIA_B_0X1        (0x1u<<0)

// L2RCR Configuration

#define LTDC_L2RCR_GRMSK            (0x1u<<2)
#define LTDC_L2RCR_VBR              (0x1u<<1)
#define LTDC_L2RCR_IMR              (0x1u<<0)

#define LTDC_L2RCR_GRMSK_B_0X0      (0x0u<<2)
#define LTDC_L2RCR_GRMSK_B_0X1      (0x1u<<2)
#define LTDC_L2RCR_VBR_B_0X0        (0x0u<<1)
#define LTDC_L2RCR_VBR_B_0X1        (0x1u<<1)
#define LTDC_L2RCR_IMR_B_0X0        (0x0u<<0)
#define LTDC_L2RCR_IMR_B_0X1        (0x1u<<0)

// L2CR Configuration

#define LTDC_L2CR_DCBEN             (0x1u<<9)
#define LTDC_L2CR_HMEN              (0x1u<<8)
#define LTDC_L2CR_CLUTEN            (0x1u<<4)
#define LTDC_L2CR_CKEN              (0x1u<<1)
#define LTDC_L2CR_LEN               (0x1u<<0)

#define LTDC_L2CR_DCBEN_B_0X0       (0x0u<<9)
#define LTDC_L2CR_DCBEN_B_0X1       (0x1u<<9)
#define LTDC_L2CR_HMEN_B_0X0        (0x0u<<8)
#define LTDC_L2CR_HMEN_B_0X1        (0x1u<<8)
#define LTDC_L2CR_CLUTEN_B_0X0      (0x0u<<4)
#define LTDC_L2CR_CLUTEN_B_0X1      (0x1u<<4)
#define LTDC_L2CR_CKEN_B_0X0        (0x0u<<1)
#define LTDC_L2CR_CKEN_B_0X1        (0x1u<<1)
#define LTDC_L2CR_LEN_B_0X0         (0x0u<<0)
#define LTDC_L2CR_LEN_B_0X1         (0x1u<<0)

// L2WHPCR Configuration

#define LTDC_L2WHPCR_WHSPPOS        (0xFFFu<<16)
#define LTDC_L2WHPCR_WHSPPOS_0      (0x1u<<16)
#define LTDC_L2WHPCR_WHSTPOS        (0xFFFu<<0)
#define LTDC_L2WHPCR_WHSTPOS_0      (0x1u<<0)

// L2WVPCR Configuration

#define LTDC_L2WVPCR_WVSPPOS        (0xFFFu<<16)
#define LTDC_L2WVPCR_WVSPPOS_0      (0x1u<<16)
#define LTDC_L2WVPCR_WVSTPOS        (0xFFFu<<0)
#define LTDC_L2WVPCR_WVSTPOS_0      (0x1u<<0)

// L2CKCR Configuration

#define LTDC_L2CKCR_CKRED           (0xFFu<<16)
#define LTDC_L2CKCR_CKRED_0         (0x1u<<16)
#define LTDC_L2CKCR_CKGREEN         (0xFFu<<8)
#define LTDC_L2CKCR_CKGREEN_0       (0x1u<<8)
#define LTDC_L2CKCR_CKBLUE          (0xFFu<<0)
#define LTDC_L2CKCR_CKBLUE_0        (0x1u<<0)

// L2PFCR Configuration

#define LTDC_L2PFCR_PF              (0x7u<<0)
#define LTDC_L2PFCR_PF_0            (0x1u<<0)

#define LTDC_L2PFCR_PF_B_0X0        (0x0u<<0)
#define LTDC_L2PFCR_PF_B_0X1        (0x1u<<0)
#define LTDC_L2PFCR_PF_B_0X2        (0x2u<<0)
#define LTDC_L2PFCR_PF_B_0X3        (0x3u<<0)
#define LTDC_L2PFCR_PF_B_0X4        (0x4u<<0)
#define LTDC_L2PFCR_PF_B_0X5        (0x5u<<0)
#define LTDC_L2PFCR_PF_B_0X6        (0x6u<<0)
#define LTDC_L2PFCR_PF_B_0X7        (0x7u<<0)

// L2CACR Configuration

#define LTDC_L2CACR_CONSTA          (0xFFu<<0)
#define LTDC_L2CACR_CONSTA_0        (0x1u<<0)

// L2DCCR Configuration

#define LTDC_L2DCCR_DCALPHA         (0xFFu<<24)
#define LTDC_L2DCCR_DCALPHA_0       (0x1u<<24)
#define LTDC_L2DCCR_DCRED           (0xFFu<<16)
#define LTDC_L2DCCR_DCRED_0         (0x1u<<16)
#define LTDC_L2DCCR_DCGREEN         (0xFFu<<8)
#define LTDC_L2DCCR_DCGREEN_0       (0x1u<<8)
#define LTDC_L2DCCR_DCBLUE          (0xFFu<<0)
#define LTDC_L2DCCR_DCBLUE_0        (0x1u<<0)

// L2BFCR Configuration

#define LTDC_L2BFCR_BOR             (0x1u<<16)
#define LTDC_L2BFCR_BF1             (0x7u<<8)
#define LTDC_L2BFCR_BF1_0           (0x1u<<8)
#define LTDC_L2BFCR_BF2             (0x7u<<0)
#define LTDC_L2BFCR_BF2_0           (0x1u<<0)

#define LTDC_L2BFCR_BOR_B_0X0       (0x0u<<16)
#define LTDC_L2BFCR_BOR_B_0X1       (0x1u<<16)
#define LTDC_L2BFCR_BF1_B_0X4       (0x4u<<8)
#define LTDC_L2BFCR_BF1_B_0X6       (0x6u<<8)
#define LTDC_L2BFCR_BF2_B_0X5       (0x5u<<0)
#define LTDC_L2BFCR_BF2_B_0X7       (0x7u<<0)

// L2BLCR Configuration

#define LTDC_L2BLCR_BL              (0x1Fu<<0)
#define LTDC_L2BLCR_BL_0            (0x1u<<0)

#define LTDC_L2BLCR_BL_B_0X00       (0x0u<<0)
#define LTDC_L2BLCR_BL_B_0X01       (0x1u<<0)
#define LTDC_L2BLCR_BL_B_0X10       (0x10u<<0)

// L2PCR Configuration

#define LTDC_L2PCR_YREN             (0x1u<<9)
#define LTDC_L2PCR_OF               (0x1u<<8)
#define LTDC_L2PCR_CBF              (0x1u<<7)
#define LTDC_L2PCR_YF               (0x1u<<6)
#define LTDC_L2PCR_YCM              (0x3u<<4)
#define LTDC_L2PCR_YCM_0            (0x1u<<4)
#define LTDC_L2PCR_YCEN             (0x1u<<3)

#define LTDC_L2PCR_YREN_B_0X0       (0x0u<<9)
#define LTDC_L2PCR_YREN_B_0X1       (0x1u<<9)
#define LTDC_L2PCR_OF_B_0X0         (0x0u<<8)
#define LTDC_L2PCR_OF_B_0X1         (0x1u<<8)
#define LTDC_L2PCR_CBF_B_0X0        (0x0u<<7)
#define LTDC_L2PCR_CBF_B_0X1        (0x1u<<7)
#define LTDC_L2PCR_YF_B_0X0         (0x0u<<6)
#define LTDC_L2PCR_YF_B_0X1         (0x1u<<6)
#define LTDC_L2PCR_YCM_B_0X0        (0x0u<<4)
#define LTDC_L2PCR_YCM_B_0X1        (0x1u<<4)
#define LTDC_L2PCR_YCM_B_0X2        (0x2u<<4)
#define LTDC_L2PCR_YCM_B_0X3        (0x3u<<4)
#define LTDC_L2PCR_YCEN_B_0X0       (0x0u<<3)
#define LTDC_L2PCR_YCEN_B_0X1       (0x1u<<3)

// L2CFBAR Configuration

#define LTDC_L2CFBAR_CFBADD         (0xFFFFFFFFu<<0)
#define LTDC_L2CFBAR_CFBADD_0       (0x1u<<0)

// L2CFBLR Configuration

#define LTDC_L2CFBLR_CFBP           (0xFFFu<<16)
#define LTDC_L2CFBLR_CFBP_0         (0x1u<<16)
#define LTDC_L2CFBLR_CFBLL          (0xFFFu<<0)
#define LTDC_L2CFBLR_CFBLL_0        (0x1u<<0)

// L2CFBLNR Configuration

#define LTDC_L2CFBLNR_CFBLNBR       (0xFFFu<<0)
#define LTDC_L2CFBLNR_CFBLNBR_0     (0x1u<<0)

// L2CLUTWR Configuration

#define LTDC_L2CLUTWR_CLUTADD       (0xFFu<<24)
#define LTDC_L2CLUTWR_CLUTADD_0     (0x1u<<24)
#define LTDC_L2CLUTWR_RED           (0xFFu<<16)
#define LTDC_L2CLUTWR_RED_0         (0x1u<<16)
#define LTDC_L2CLUTWR_GREEN         (0xFFu<<8)
#define LTDC_L2CLUTWR_GREEN_0       (0x1u<<8)
#define LTDC_L2CLUTWR_BLUE          (0xFFu<<0)
#define LTDC_L2CLUTWR_BLUE_0        (0x1u<<0)

// L2CYR0R Configuration

#define LTDC_L2CYR0R_CB2B           (0x3FFu<<16)
#define LTDC_L2CYR0R_CB2B_0         (0x1u<<16)
#define LTDC_L2CYR0R_CR2R           (0x3FFu<<0)
#define LTDC_L2CYR0R_CR2R_0         (0x1u<<0)

// L2CYR1R Configuration

#define LTDC_L2CYR1R_CB2G           (0x3FFu<<16)
#define LTDC_L2CYR1R_CB2G_0         (0x1u<<16)
#define LTDC_L2CYR1R_CR2G           (0x3FFu<<0)
#define LTDC_L2CYR1R_CR2G_0         (0x1u<<0)

// L2FPF0R Configuration

#define LTDC_L2FPF0R_RLEN           (0xFu<<14)
#define LTDC_L2FPF0R_RLEN_0         (0x1u<<14)
#define LTDC_L2FPF0R_RPOS           (0x1Fu<<9)
#define LTDC_L2FPF0R_RPOS_0         (0x1u<<9)
#define LTDC_L2FPF0R_ALEN           (0xFu<<5)
#define LTDC_L2FPF0R_ALEN_0         (0x1u<<5)
#define LTDC_L2FPF0R_APOS           (0x1Fu<<0)
#define LTDC_L2FPF0R_APOS_0         (0x1u<<0)

