Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_ltdc.h
// L2FPF1R Configuration

#define LTDC_L2FPF1R_PSIZE          (0x7u<<18)
#define LTDC_L2FPF1R_PSIZE_0        (0x1u<<18)
#define LTDC_L2FPF1R_BLEN           (0xFu<<14)
#define LTDC_L2FPF1R_BLEN_0         (0x1u<<14)
#define LTDC_L2FPF1R_BPOS           (0x1Fu<<9)
#define LTDC_L2FPF1R_BPOS_0         (0x1u<<9)
#define LTDC_L2FPF1R_GLEN           (0xFu<<5)
#define LTDC_L2FPF1R_GLEN_0         (0x1u<<5)
#define LTDC_L2FPF1R_GPOS           (0x1Fu<<0)
#define LTDC_L2FPF1R_GPOS_0         (0x1u<<0)

// SECCFGR Configuration

#define LTDC_SECCFGR_UPSEC          (0x1u<<2)
#define LTDC_SECCFGR_LOSEC          (0x1u<<1)
#define LTDC_SECCFGR_CSEC           (0x1u<<0)

#define LTDC_SECCFGR_UPSEC_B_0X0    (0x0u<<2)
#define LTDC_SECCFGR_UPSEC_B_0X1    (0x1u<<2)
#define LTDC_SECCFGR_LOSEC_B_0X0    (0x0u<<1)
#define LTDC_SECCFGR_LOSEC_B_0X1    (0x1u<<1)
#define LTDC_SECCFGR_CSEC_B_0X0     (0x0u<<0)
#define LTDC_SECCFGR_CSEC_B_0X1     (0x1u<<0)

// PRIVCFGR Configuration

#define LTDC_PRIVCFGR_UPPRIV        (0x1u<<2)
#define LTDC_PRIVCFGR_LOPRIV        (0x1u<<1)
#define LTDC_PRIVCFGR_CPRIV         (0x1u<<0)

#define LTDC_PRIVCFGR_UPPRIV_B_0X0  (0x0u<<2)
#define LTDC_PRIVCFGR_UPPRIV_B_0X1  (0x1u<<2)
#define LTDC_PRIVCFGR_LOPRIV_B_0X0  (0x0u<<1)
#define LTDC_PRIVCFGR_LOPRIV_B_0X1  (0x1u<<1)
#define LTDC_PRIVCFGR_CPRIV_B_0X0   (0x0u<<0)
#define LTDC_PRIVCFGR_CPRIV_B_0X1   (0x1u<<0)

// RCFGLOCKR Configuration

#define LTDC_RCFGLOCKR_UPLOCK       (0x1u<<2)
#define LTDC_RCFGLOCKR_LOLOCK       (0x1u<<1)
#define LTDC_RCFGLOCKR_CLOCK        (0x1u<<0)

#define LTDC_RCFGLOCKR_UPLOCK_B_0X0 (0x0u<<2)
#define LTDC_RCFGLOCKR_UPLOCK_B_0X1 (0x1u<<2)
#define LTDC_RCFGLOCKR_LOLOCK_B_0X0 (0x0u<<1)
#define LTDC_RCFGLOCKR_LOLOCK_B_0X1 (0x1u<<1)
#define LTDC_RCFGLOCKR_CLOCK_B_0X0  (0x0u<<0)
#define LTDC_RCFGLOCKR_CLOCK_B_0X1  (0x1u<<0)

// PUBCFGR Configuration

#define LTDC_PUBCFGR_UPPUB          (0x1u<<2)
#define LTDC_PUBCFGR_LOPUB          (0x1u<<1)
#define LTDC_PUBCFGR_CPUB           (0x1u<<0)

#define LTDC_PUBCFGR_UPPUB_B_0X0    (0x0u<<2)
#define LTDC_PUBCFGR_UPPUB_B_0X1    (0x1u<<2)
#define LTDC_PUBCFGR_LOPUB_B_0X0    (0x0u<<1)
#define LTDC_PUBCFGR_LOPUB_B_0X1    (0x1u<<1)
#define LTDC_PUBCFGR_CPUB_B_0X0     (0x0u<<0)
#define LTDC_PUBCFGR_CPUB_B_0X1     (0x1u<<0)
